<!DOCTYPE html>
<html lang="es">
<head>
	<link rel="stylesheet" href="htmlPracticeStyle.css" type="text/css" media="screen">
	<link rel="stylesheet" href="animate2.css">
	<title>Codificaci&oacute;n del HTML: Cap&iacute;tulo 1</title>
</head>
<body>

	<div class="nav">
		<ul>
			<li class="Inicio"><a href="Inicio.html">Inicio</a>
			<li class="Tutor&iactue;a"><a href="Guias.html">Guias</a>
				<ul>
					<li><a href="Capitulo1.html" title="Captitulo1">Cap&iacute;tulo 1</a></li>
					<li><a href="Capitulo2.html" title="Capitulo2">Cap&iacute;tulo 2</a></li>
				</ul>
			</li>
			<li><a href="#about">About</a></li>
		</ul>
	</div>
<br>
<br>
<br><a name="zero"></a>
<h1 class="animated flipInX">Cap&iacute;tulo 1</h1> 
<br>
<div class="animated fadeIn"><a name="one"></a>
	<h2 class="title"><b>Elementos b&aacute;sicos</b></h2>
</div>
	<p>
		<div class="animated fadeIn" id="imageEx"><pre><img class="image"src="Example1.png" width="412" height="228" alt="Example1"></pre></div>
	</p>
<div class="container">
	<p class="animated fadeIn">
Estos son los elementos de esquema b&aacute;sico de una p&aacute;gina HTML codificado:
	<br>
El DOCTYPE declaraci&oacute;n define el tipo de de documento como <b>HTML</b>.
	<br>El texto entre html y /html define un documento HTML. 
	<br>
	<br>Hay varias versiones de HTML incluyendo HTML, HTML 2.0, HTML 4.01, XHTML, y HTML5.
	<br>El texto entre &lthead&gt y &lthead&gt proporciona a la informaci&oacute;n sobre el documento.
	<br>El texto entre &lttitle&gt y &lt/title&gt proporciona al t&iacute;tulo para el documento. 
	<br>El texto entre &lth1&gt y &lt/h1&gt describe un subt&iacute;tulo en el documento.
	<br>El texto entre &ltp&gt y &lt/p&gt describe un p&aacute;rrafo en el documento. 
<br><br><textarea id="NoTinyMCE" cols="50">Practica Aqu&iacute;.</textarea>
	</p>
</div>
<div class="animated fadeIn"><a name="two"></a>
	<h3 class="title"><b>Elementos m&aacute;s espec&iacute;ficos</b></h3>
</div>
	<pre><div id="imageEx"><img class="image" src="Example2.png" width="412" height="308" alt="Example2"></div></pre>
<div class="container">
	<p>
Enlaces se pueden ser definidas con la etiqueta <b>a</b>.
		<br>El destino del enlace es el <b>href attribute</b>. 
		<br>Para Definir im&aacute;genes HTML, utilice la etiqueta <b>img</b>.
		<br>Los atributos se proporcionan en la etiqueta <b>img</b> son el archivo de origen <b>src</b>, texto alternativo <b>alt</b> y el tama&ntilde; <b>width</b> y <b>height</b>.
	</p>
	<p>
		<b>M&aacute;s informaci&oacute;n sobre los atributos:</b>
		<br>Elementos HTML pueden haber encajado caracter&iacute;sticas llamados atributos. Los atributos proporcionan informaci&oacute;n adicional sobre un elemento. Ellos siempre est&aacute;n especificados en la etiqueta de inicio. <br>
		Tipos de atributos son el Atributo Lang (para declarar un idioma), el Atributo T&iacute;tulo (que pueden ser declerado en el elemento p), el Atributo href (Links HTML que est&aacute;n definido con la etiqueta a), el Atributo Size, el Atributo alt (define el texto alternative que puede ser usando quando un elemento HTML no puede ser demonstrado). <br>Algos sugesti&oacute;nes est&aacute;n que siempre use los atributos lowercase y siempre cotizaci&oacute;n valores de los atributos.
<br><br><textarea id="NoTinyMCE" cols="50">Practica Aqu&iacute;.</textarea>
	</p>
</div>
<div class="animated fadeIn"><a name="three"></a>
	<h4 class="title"><b>Creando formateo y separaci&oacute;n</b></h4>
</div>
	<div id="imageEx">
		<img class="image" src="Example3.png" width="412" height="624" alt="Example3">
	</div>
<div class="container">	
	<p>
		<b>Insertando un salto de l&iacute;nea:</b>
		<br>El &lthr&gt etiqueta crea una l&iacute;nea horizontal en una p&aacute;gina HTML y se puede utilizar para separar el contenido. 
		<br>Utilice &ltbr&gt si quieres una nueva l&iacute;nea sin necesidad de iniciar un nuevo p&aacute;rrafo. &ltbr&gt no crear&aacute; una l&iacute;nea visible.
		<br>
		<br><b>Definici&oacute;nando texto preformateado</b>
		<br>A&ntilde;adir un &ltpre&gt alrededor del texto que tiene un formato fijo y el ancho. Esto preserva ambos espacios y saltos de l&iacute;nea. Es &uacute;til para el texto, como los poemas. 
		<br><br><textarea id="NoTinyMCE" cols="50">Las Notas Aqu&iacute;.</textarea>
	</p>
</div>
<div class="back3top">
	<a href="Capitulo1.html#top" id="back2top">Back to Top</a>
</div>

</body>
</html>